/* ===== Generic ===== */

/* Generic Cancel button title, used in SKConversation NSErrorFromPREMIUM_VIDEO_STATUS */
"BUTTONTITLE_CANCEL" = "ยกเลิก";

/* ===== SkyLib Properties ===== */

/* List item title for user's home phone number. */
"CONTACT_PHONE_HOME" = "บ้าน";

/* List item title for user's office phone number */
"CONTACT_PHONE_OFFICE" = "ที่ทำงาน";

/* List item title for user's mobile phone number. */
"CONTACT_PHONE_MOBILE" = "มือถือ";

/* List item title for user's (possible) other phone number(s). */
"CONTACT_PHONE_OTHER" = "อื่นๆ";

/* Format to use to wrap guest contact displays */
"CONTACT_GUEST_FORMAT" = "%@ (ผู้เยี่ยมชม)";

/* All known contacts group title */
"CONTACT_GROUP_ALL_KNOWN_CONTACTS" = "ผู้ติดต่อที่รู้จักทั้งหมด";

/* All buddies group title */
"CONTACT_GROUP_ALL_BUDDIES" = "ผู้ติดต่อทั้งหมด";

/* Skype group title */
"CONTACT_GROUP_SKYPE_BUDDIES" = "ผู้ติดต่อใน Skype";

/* SkypeOut group title */
"CONTACT_GROUP_SKYPEOUT_BUDDIES" = "หมายเลขโทรศัพท์ที่บันทึกไว้";

/* Online buddies group title */
"CONTACT_GROUP_ONLINE_BUDDIES" = "ผู้ติดต่อออนไลน์";

/* Unknown or pending auth group title */
"CONTACT_GROUP_UNKNOWN_OR_PENDINGAUTH_BUDDIES" = "ส่งคำขอแล้ว";

/* Recently contacted group title */
"CONTACT_GROUP_RECENTLY_CONTACTED_CONTACTS" = "ที่ติดต่อกันเมื่อเร็วๆ นี้";

/* Contacts waiting my auth group title */
"CONTACT_GROUP_CONTACTS_WAITING_MY_AUTHORIZATION" = "ได้รับคำขอแล้ว";

/* Authorized by me group title */
"CONTACT_GROUP_CONTACTS_AUTHORIZED_BY_ME" = "ยอมรับคำขอแล้ว";

/* Blocked group title */
"CONTACT_GROUP_CONTACTS_BLOCKED_BY_ME" = "ผู้ติดต่อที่บล็อกไว้";

/* Ungrouped contacts group title */
"CONTACT_GROUP_UNGROUPED_BUDDIES" = "ผู้ติดต่อที่ไม่อยู่ในกลุ่ม";

/* Windows Live ID contacts group title */
"CONTACT_GROUP_PASSPORT_CONTACTS" = "Messenger";

/* Suggested contacts group title */
"CONTACT_GROUP_SCD_CONTACTS" = "ผู้ติดต่อที่แนะนำ";

/* New group default title */
"CONTACT_GROUP_NEW_GROUP" = "รายชื่อที่ยังไม่มีชื่อ";

/* Default message sent to contacts from whom we are requesting authorization */
"CONTACT_AUTH_REQUEST_DEFAULT_MESSAGE" = "โปรดเพิ่มฉันเป็นผู้ติดต่อ";

/*  */
"ECHO123_CONTACT_FULLNAME" = "การทดสอบการโทรผ่าน Skype";

/*  */
"ECHO123_CONTACT_LANGUAGES" = "th";

/*  */
"ECHO123_CONTACT_HOMEPAGE" = "www.skype.com/go/help";

/* Automatic sound test service mood message. */
"ECHO123_CONTACT_ABOUT" = "สวัสดี นี่คือหุ่นยนต์ของการทดสอบการโทรผ่าน Skype เพิ่มฉันลงในผู้ติดต่อของคุณและโทรหาฉันเพื่อตรวจสอบการตั้งค่าเสียงของคุณ ดูที่ http://www.skype.com/go/help สำหรับความช่วยเหลือเพิ่มเติม ขอขอบคุณ";

/*  */
"ECHO123_CONTACT_MOOD_TEXT" = "โทรหาฉันเพื่อทดสอบเสียงของคุณ";


/* UNPLACED call status used when a call is initialized, but not connected to the network yet. */
"CALL_STATUS_UNPLACED" = "กำลังเริ่มต่อสายของคุณ";

/* ROUTING call status used when a call is being routed by the network but not ringing yet. */
"CALL_STATUS_ROUTING" = "กำลังเริ่มต่อสายของคุณ";

/* CANCELLED call status indicating that the outgoing call was cancelled by the user. */
"CALL_STATUS_CANCELLED" = "ยกเลิกการโทร";

/* FAILED call status used when the call failed. */
"CALL_STATUS_FAILED" = "การต่อสายล้มเหลว";

/* RINGING_OUT call status used when a call is ringing for the remote party. */
"CALL_STATUS_RINGING_OUT" = "กำลังโทรออก";

/* RINGING_IN call status used when a call is ringing locally. */
"CALL_STATUS_RINGING_IN" = "มีสายโทรเข้า";

/* LOCALHOLD call status indicating that the user put the call on hold. */
"CALL_STATUS_LOCALHOLD" = "สายที่พักไว้";

/* REMOTEHOLD call status indicating that the call is on hold by the remote party. */
"CALL_STATUS_REMOTEHOLD" = "คุณถูกพักสายไว้";

/* FINISHED call status indicating that the call was finished. */
"CALL_STATUS_FINISHED" = "เสร็จสิ้น";

/* MISSED call status indicating that the incoming call was finished before it got answered. */
"CALL_STATUS_MISSED" = "ไม่ได้รับ";

/* REFUSED call status indicating that the remote party declined the call. */
"CALL_STATUS_REFUSED" = "ปฏิเสธ";

/* BUSY call status indicating that the remote party was already in a call. */
"CALL_STATUS_BUSY" = "ไม่ว่าง";

/* DROPPED call status indicating that the network connection was lost during the call. */
"CALL_STATUS_DROPPED" = "การเชื่อมต่อขาดหาย";

/* VOICEMAIL call status indicating that the call was diverted to voicemail. */
"CALL_STATUS_VOICEMAIL" = "ข้อความเสียง";

/* VM_RECORDING call status while recording the voicemail. */
"CALL_STATUS_VM_RECORDING" = "กำลังบันทึกข้อความเสียง";

/* VM_UPLOADING call status while sending the voicemail. */
"CALL_STATUS_VM_UPLOADING" = "กำลังส่งข้อความเสียง";

/* VM_SENT call status after the voicemail was sent. */
"CALL_STATUS_VM_SENT" = "ส่งข้อความเสียงแล้ว";

/* VM_CANCELLED call status when the recording or sending of the voicemail was cancelled. */
"CALL_STATUS_VM_CANCELLED" = "ยกเลิกข้อความเสียงแล้ว";

/* VM_FAILED call status when the recording or sending of the voicemail failed. */
"CALL_STATUS_VM_FAILED" = "ข้อความเสียงล้มเหลว";

/* ===== Wallet Transacation ===== */
/* Title of instrument name in popup button (args: instrument name ["Visa"], number ["****1234"]) */
"WALLET_INSTRUMENT_DISPLAY_NAME_FORMAT" = "%1$@ %2$@";


/* ===== PARTICIPANT_VOICE_STATUS ===== */ 

/* VOICE_CONNECTING status used when a call is being routed by the network but not ringing yet. */
"PARTICIPANT_VOICE_STATUS_CONNECTING" = "กำลังเชื่อมต่อ";

/* RINGING status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_RINGING" = "กำลังโทรออก";

/* EARLY_MEDIA status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_EARLY_MEDIA" = "กำลังโทรออก";

/* ON_HOLD status when a participant is held. */
"PARTICIPANT_VOICE_STATUS_ON_HOLD" = "พักสายไว้";

/* STOPPED status when a participant has stopped. */
"PARTICIPANT_VOICE_STATUS_STOPPED" = "สิ้นสุด";

/* FACEBOOK calling */
"PARTICIPANT_VOICE_STATUS_CONNECTING_FACEBOOK" = "กำลังโทรไปใน Facebook (Beta)";

/* ===== CONVERSATION_LOCAL_LIVESTATUS ===== */ 
"CONVERSATION_LOCAL_LIVESTATUS_STARTING" = "กำลังโทร…";
"CONVERSATION_LOCAL_LIVESTATUS_RINGING_FOR_ME" = "กำลังโทร…";
"CONVERSATION_LOCAL_LIVESTATUS_IM_LIVE" = "กำลังดำเนินการโทร";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_LOCALLY" = "พักสายไว้";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_REMOTELY" = "คุณถูกพักสายไว้";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE" = "กำลังดำเนินการโทร";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE_FULL" = "การโทรเต็มแล้ว";
"CONVERSATION_LOCAL_LIVESTATUS_PLAYING_VOICE_MESSAGE" = "กำลังเล่นคำทักทายของข้อความเสียง";
"CONVERSATION_LOCAL_LIVESTATUS_RECORDING_VOICE_MESSAGE" = "กำลังบันทึกข้อความเสียง";
"CONVERSATION_LOCAL_LIVESTATUS_RECENTLY_LIVE" = "การโทรล่าสุด";
"CONVERSATION_LOCAL_LIVESTATUS_TRANSFERRING" = "กำลังโอนสายนี้";


/*  */
"CONVERSATION_POST_FILES_BODY" = "ไฟล์ที่โพสต์ไว้";

/* CONVERSATION Legacy chat message for older clients */
"CONVERSATION_VIDEOMESSAGE_LEGACY_MESSAGE" = "คุณได้รับข้อความวิดีโอ ดูข้อความนั้นที่: %1 แล้วเปิดโดยใช้รหัส %2";

"CONVERSATION_XMM_LEGACY_MESSAGE" = "%1$@ - ดูได้ที่ %%1";

"CONVERSATION_MEDIAMESSAGE_LEGACY_MESSAGE" = "เมื่อต้องการดูภาพถ่ายที่แชร์นี้ ให้ไปที่: %1";
"CONVERSATION_XMM_MESSAGE_LEGACY_MESSAGE" = "เมื่อต้องการดูสื่อที่แชร์นี้ ให้ไปที่ %1";

/*  */
"CONTACT_AVAILABILITY_OFFLINE" = "ออฟไลน์";
"CONTACT_AVAILABILITY_ONLINE" = "ออนไลน์";
"CONTACT_AVAILABILITY_AWAY" = "ไม่อยู่";
"CONTACT_AVAILABILITY_DO_NOT_DISTURB" = "ห้ามรบกวน";
"CONTACT_AVAILABILITY_PENDING_AUTH" = "คำขอเป็นผู้ติดต่อที่ค้างอยู่";
"CONTACT_AVAILABILITY_BLOCKED" = "บล็อกไว้";
"CONTACT_AVAILABILITY_OFFLINE_BUT_VM_ABLE" = "ออฟไลน์พร้อมส่งข้อความเสียง";
"CONTACT_AVAILABILITY_OFFLINE_BUT_CF_ABLE" = "โอนสาย";

/*  */
"CONTACT_AVAILABILITY_INVISIBLE" = "ไม่แสดงสถานะ";
"CONTACT_AVAILABILITY_CONNECTING" = "กำลังเชื่อมต่อ";
"CONTACT_AVAILABILITY_SKYPEOUT" = "หมายเลขโทรศัพท์";

/*  */
"CONTACT_GENDER_FEMALE" = "หญิง";

/*  */
"CONTACT_GENDER_MALE" = "ชาย";

/* A hidden phone number. */
"CONTACT_UNKNOWN_PSTN_DISPLAYNAME" = "หมายเลขที่ไม่รู้จัก";

/* Title for conversation with no participants */
"CONVERSATION_UNTITLED_DISPLAYNAME" = "ไม่มีชื่อ";


"ACCOUNTMANAGER_LOGIN_STATUS" = "กำลังลงชื่อเข้าใช้…";
"ACCOUNTMANAGER_CBLSYNC_STATUS" = "กำลังโหลดผู้ติดต่อ…";
"ACCOUNTMANAGER_UPGRADEDB_STATUS" = "กำลังอัพเกรดไฟล์…";


/* Chat info message when a party has been joined to the chat. %1$@ is the name of the user who did the adding, while %2$@ is the name of the added user. */
"ChatMessage::ADDEDMEMBERS_FORMATSTRING" = "%1$@ ได้เพิ่ม %2$@";

/* Chat info message shown when user %@ has left the chat. */
"ChatMessage::LEFT_FORMATSTRING" = "%@ ได้ออกไปแล้ว";

/* Chat info message when the first user ejected (threw out) the second user from the chat. */
"ChatMessage::KICKED_FORMATSTRING" = "%1$@ ได้นำ %2$@ ออกไปแล้ว";

/* Chat info message shown when a party has changed the chat topic. %1$@ is the user who did it, and %2$@ the new topic. */
"ChatMessage::SETTOPIC_FORMATSTRING" = "%1$@ ได้เปลี่ยนหัวข้อการแชทเป็น %2$@";

/* Chat item shown in place of the message to tell that the message has been removed by its writer. */
"CHATMESSAGE_MESSAGEREMOVED_TEXT" = "ข้อความนี้ถูกนำออกไปแล้ว";

/* AV Preferences output device name */
"SAME_AS_SYSTEM_DEVICE_NAME" = "เหมือนกับในระบบ";


/* ===== SkyLib Error/Result Codes ===== */

/* sync errors at login/registration */
"LOGOUTREASON_NETWORKERROR" = "ไม่สามารถเชื่อมต่อกับ Skype ได้";
"LOGOUTREASON_NETWORKERROR_RECOVERYSUGGESTION" = "โปรดตรวจสอบการตั้งค่าเครือข่ายของคุณแล้วลองอีกครั้ง";

/* sync errors at registration */
"Account::INVALID_SKYPENAME" = "ชื่อ Skype นี้ไม่ถูกต้อง";
"Account::INVALID_EMAIL" = "อีเมลแอดเดรสนี้ไม่ถูกต้อง";
"Account::INVALID_EMAIL_RECOVERYSUGGESTION" = "โปรดตรวจสอบและลองอีกครั้ง";
"Account::UNACCEPTABLE_PASSWORD" = "รหัสผ่านนี้ไม่ถูกต้อง";
"Account::SKYPENAME_TAKEN" = "ชื่อ Skype นี้มีผู้อื่นใช้อยู่แล้ว";
"Account::SKYPENAME_TAKEN_RECOVERYSUGGESTION" = "โปรดป้อนชื่อใหม่";

/* sync errors at login */
"Account::NO_SUCH_IDENTITY" = "เราไม่รู้จักชื่อ Skype และรหัสผ่านของคุณ";
"Account::INCORRECT_PASSWORD" = "เราไม่รู้จักชื่อ Skype และรหัสผ่านของคุณ";
"Account::TOO_MANY_LOGIN_ATTEMPTS" = "พยายามลงชื่อเข้าใช้แต่ไม่สำเร็จหลายครั้งเกินไป";
"Account::TOO_MANY_LOGIN_ATTEMPTS_RECOVERYSUGGESTION" = "โปรดลองอีกครั้งในภายหลัง";

/* async errors (can happen anytime while logged in) */
"Account::PASSWORD_HAS_CHANGED" = "คุณได้เปลี่ยนรหัสผ่านแล้ว";
"Account::PASSWORD_HAS_CHANGED_RECOVERYSUGGESTION" = "โปรดลงชื่อเข้าใช้ด้วยรหัสผ่านใหม่ของคุณ";

"LOGOUTREASON_GENERIC_RECOVERYSUGGESTION" = "โปรดลองอีกครั้ง";

/* Account property validation error - NSLocalizedFailureReasonErrorKey [#HELLC-1021], [#WIN-364] */
"SkyLib::TOO_SHORT" = "จำเป็นต้องมีอักขระยาว 6-20 ตัว";
"SkyLib::TOO_LONG" = "จำเป็นต้องมีอักขระยาว 6-20 ตัว";
"SkyLib::CONTAINS_INVALID_CHAR" = "อักขระไม่ถูกต้อง เช่น Σ, à, ß";
"SkyLib::CONTAINS_SPACE" = "ไม่สามารถมีช่องว่างหรือแท็บได้";
"SkyLib::SAME_AS_USERNAME" = "คล้ายกับชื่อ Skype ของคุณมากเกินไป";
"SkyLib::INVALID_FORMAT" = "รูปแบบไม่ถูกต้อง";
"SkyLib::CONTAINS_INVALID_WORD" = "เดาได้ง่ายเกินไป เช่น abcd, skype";
"SkyLib::TOO_SIMPLE" = "ต้องมีตัวอักษร 1 ตัว และตัวเลข 1 ตัวเป็นอย่างน้อย";
"SkyLib::STARTS_WITH_INVALID_CHAR" = "ต้องเริ่มต้นด้วยตัวอักษร (A–Z)";

/* Account property validation error - NSLocalizedRecoverySuggestionErrorKey */
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "ลองใช้ชื่อ Skype ที่ยาวขึ้น";
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "ลองใช้รหัสผ่านที่ยาวขึ้น";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "ลองใช้ชื่อ Skype ที่สั้นลง";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "ลองใช้รหัสผ่านที่สั้นลง";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "ลองใช้ชื่อ Skype ใหม่";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "ลองใช้รหัสผ่านใหม่";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_EMAILS" = "ลองใช้อีเมลแอดเดรสใหม่";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION" = "ลองใช้ค่าใหม่";

/* Account password change error - NSLocalizedFailureReasonErrorKey */
"Account::PWD_INVALID_OLD_PASSWORD" = "รหัสผ่านไม่ถูกต้อง";
"Account::PWD_SERVER_CONNECT_FAILED" = "ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ได้";
"Account::PWD_MUST_DIFFER_FROM_OLD" = "รหัสผ่านใหม่ต้องแตกต่างจากรหัสผ่านเดิม";
"Account::PWD_INVALID_NEW_PWD" = "รหัสผ่านไม่ถูกต้อง";
"Account::PWD_MUST_LOG_IN_TO_CHANGE" =  "ต้องลงชื่อเข้าใช้เพื่อเปลี่ยนรหัสผ่านของคุณ";

/* COMMITFAILED status received when committing a server-side property change. */
"ACCOUNT_COMMITSTATUS_COMMIT_FAILED" = "ไม่สามารถบันทึกการเปลี่ยนแปลงของคุณได้ ตรวจสอบการตั้งค่าแล้วลองอีกครั้ง";

"ACCOUNT_NOCREDIT" = "ไม่มีเครดิต";
"ACCOUNT_FREECALL" = "โทรฟรี";

/* Conversation file transfer errors */
"SkyLib::TRANSFER_BAD_FILENAME" = "ชื่อไฟล์ไม่ถูกต้อง";
"SkyLib::TRANSFER_OPEN_FAILED" = "การเปิดไฟล์ล้มเหลว";
"SkyLib::TRANSFER_TOO_MANY_PARALLEL" = "มีการโอนไฟล์พร้อมกันมากเกินไป";

/* ===== SKSkypeKitErrorDomain Errors ===== */

/* SKErrorOffline */
"SKERROR_OFFLINE_DESCRIPTION" = "คุณออฟไลน์อยู่";

"SKERROR_OFFLINE_CALL_FAILUREREASON" = "คุณต้องออนไลน์เพื่อทำการโทร";
"SKERROR_OFFLINE_CONTACTSEARCH_FAILUREREASON" = "คุณไม่สามารถค้นหาผู้ติดต่อได้เมื่อคุณออฟไลน์ เปลี่ยนสถานะของคุณแล้วลองอีกครั้ง";
"SKERROR_OFFLINE_SMS_FAILUREREASON" = "คุณต้องออนไลน์เพื่อส่ง SMS";

/* [#HELLC-894] */
"SKERROR_OFFLINE_VOICEMAIL_FAILUREREASON" = "คุณต้องออนไลน์เพื่อเล่นข้อความนี้";

/* Alert sheet title */
"SKERROR_CANNOT_SET_BODY_SMS_DESCRIPTION" = "ไม่สามารถกำหนดเนื้อหาของ SMS ปัจจุบันได้";


/* SKErrorInsufficientFunds */
"Sms::INSUFFICIENT_FUNDS" = "คุณมีเครดิต Skype ไม่พอที่จะส่ง SMS";
"CMEMBER_PSTN_STATUSTEXT_INSUFFICIENTCREDIT" = "คุณต้องมีเครดิต Skype จึงจะโทรถึงหมายเลขนี้ได้";

/* SKErrorInvalidContact */
"SKERROR_INVALIDCONTACT" = "ไม่ใช่ชื่อ Skype หรือหมายเลขโทรศัพท์ที่ถูกต้อง";

/* SKErrorCallOfflineLyncContact */
"SKERROR_OFFLINELYNCCONTACT_CALL_FAILUREREASON" = "คุณไม่สามารถโทรถึงผู้ติดต่อ Lync ได้เนื่องจากพวกเขาออฟไลน์อยู่";

/* SKErrorBlockedContact */
"SKERROR_CONTACTBLOCKED_CALL_FAILUREREASON" = "คุณไม่สามารถโทรถึงบุคคลนี้ได้เนื่องจากคุณได้บล็อกบุคคลดังกล่าวไว้";
"SKERROR_CONTACTBLOCKED_CHAT_FAILUREREASON" = "คุณไม่สามารถแชทกับบุคคลนี้ได้เนื่องจากคุณได้บล็อกบุคคลดังกล่าวไว้";
"SKERROR_CONTACTBLOCKED_SMS_FAILUREREASON" = "คุณไม่สามารถส่ง SMS ไปถึงบุคคลนี้ได้เนื่องจากคุณได้บล็อกบุคคลดังกล่าวไว้";
"SKERROR_CONTACTBLOCKED_ADD_FAILUREREASON" = "คุณไม่สามารถเพิ่มบุคคลนี้ได้เนื่องจากคุณได้บล็อกบุคคลดังกล่าวไว้";

/* SKErrorCantTalkToYourself */
"SKERROR_CANTTALKTOYOURSELF_CALL_FAILUREREASON" = "คุณไม่สามารถโทรหาตัวคุณเองได้";
"SKERROR_CANTTALKTOYOURSELF_CHAT_FAILUREREASON" = "คุณไม่สามารถแชทกับตัวคุณเองได้";
"SKERROR_CANTTALKTOYOURSELF_ADD_FAILUREREASON"  = "คุณไม่สามารถเพิ่มตัวคุณเองได้";

/* SKErrorCantJoinConversation */
"SKERROR_CANTJOINCONVERSATION_FAILUREREASON" = "คุณไม่สามารถเข้าร่วมการสนทนานี้ได้";

/* SKErrorCantFindConversation */
"SKERROR_CANTFINDCONVERSATION_FAILUREREASON" = "ไม่สามารถค้นหาการสนทนานี้ได้";

/* SKErrorInvalidPSTNNumber */
"CMEMBER_PSTN_STATUSTEXT_INVALIDNUMBER" = "ไม่ใช่หมายเลขโทรศัพท์ที่ถูกต้อง";

/* SKErrorEmergencyPSTNNumber */
"SKERROR_EMERGENCYCALL_FAILUREREASON" = "คุณไม่สามารถโทรถึงหมายเลขนี้ได้เนื่องจากเป็นหมายเลขฉุกเฉิน";
"SKERROR_EMERGENCYSMS_FAILUREREASON" = "คุณไม่สามารถส่ง SMS ถึงหมายเลขนี้ได้เนื่องจากเป็นหมายเลขฉุกเฉิน";
"SKERROR_EMERGENCYADD_FAILUREREASON" = "คุณไม่สามารถเพิ่มหมายเลขนี้ได้เนื่องจากเป็นหมายเลขฉุกเฉิน";

/* SKErrorCallExists */
"SKERROR_CALLEXISTS_CALL" = "คุณต้องสิ้นสุดการโทรครั้งนี้ก่อนที่คุณจะเริ่มต้นการโทรครั้งใหม่";
"SKERROR_CALLEXISTS_VOICEMAIL" = "เมื่อต้องการฟังข้อความเสียง ให้สิ้นสุดการโทรครั้งนี้ก่อน";
"SKERROR_CALLFAILED" = "การโทรล้มเหลว โปรดลองใหม่อีกครั้ง";

/* SKErrorTooManyChatParticipants */
"SKERROR_TOOMANYPARTICIPANTS_CHAT_DESCRIPTION" = "คุณได้พยายามเริ่มต้นการสนทนากับผู้ติดต่อจำนวนมากเกินไป";

/* SKErrorInvalidConversationIdentities */
"SKERROR_INVALIDCONVERSATIONIDENTITIES_DESCRIPTION" = "คุณไม่สามารถทำการสนทนากับผู้ติดต่อเหล่านี้ได้";

/* CMEMBER_FAILUREREASON */
"CMEMBER_FAILUREREASON_CALLER_NOT_AUTHORIZED" = "คุณไม่สามารถโทรถึงบุคคลนี้ได้เนื่องจากพวกเขายังไม่ได้ยอมรับคำขอเป็นผู้ติดต่อของคุณ";
"CMEMBER_FAILUREREASON_CALLER_NOT_FRIEND" = "คุณไม่สามารถโทรถึงบุคคลนี้ได้เนื่องจากพวกเขายังไม่ได้ยอมรับคำขอเป็นผู้ติดต่อของคุณ";

/* SMS_FAILUREREASON */
"Sms::INVALID_CONFIRMATION_CODE" = "รหัสการยืนยันไม่ถูกต้อง";
"Sms::MISC_ERROR" = "หมายเลขโทรศัพท์ไม่ถูกต้อง";

/* Conversation::PREMIUM_VIDEO_STATUS */

/*
"PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE" = "PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE";
"PV_RESULT_401_P2P_BLOCK_MESSAGE" = "PV_RESULT_401_P2P_BLOCK_MESSAGE";
*/

"PV_RESULT_403_PAID_SERVICE_BLOCK_MESSAGE" = "บัญชีผู้ใช้ของคุณถูกบล็อก";
"PV_RESULT_403_PAID_SERVICE_BLOCK_EXPLANATION" = "โปรดติดต่อฝ่ายสนับสนุนลูกค้า";

"PV_RESULT_405_GROUP_TOO_LARGE_MESSAGE" = "มีบุคคลในสายสำหรับวิดีโอกลุ่มมากเกินไป";
"PV_RESULT_405_GROUP_TOO_LARGE_EXPLANATION" = "คุณสามารถทำการสนทนาทางวิดีโอได้ถึง 9 คนเท่านั้น นำบุคคลออกจากกลุ่มนี้แล้วลองใหม่อีกครั้ง";

/*
"PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE" = "PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE";
*/

"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_MESSAGE" = "มีบุคคลในสายสำหรับวิดีโอกลุ่มมากเกินไป";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION_BETA" = "คุณสามารถทำการสนทนาทางวิดีโอได้ถึง 9 คนเท่านั้น นำบุคคลออกจากการสนทนานี้แล้วลองใหม่อีกครั้ง";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION" = "การสมัครใช้งานการสนทนาทางวิดีโอเป็นกลุ่มของคุณไม่ได้ครอบคลุมถึงบุคคลเป็นจำนวนมากเท่านี้ นำบุคคลออกจากการสนทนานี้แล้วลองใหม่อีกครั้ง";

"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE_BETA" = "คุณต้องสมัครใช้งานสำหรับการสนทนาทางวิดีโอเป็นกลุ่ม";
"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE" = "คุณต้องสมัครใช้งานสำหรับการสนทนาทางวิดีโอเป็นกลุ่ม";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION_BETA" = "ต้องการสนทนาทางวิดีโอเป็นกลุ่มหรือไม่";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION" = "ต้องการสนทนาทางวิดีโอเป็นกลุ่มหรือไม่";

"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_MESSAGE" = "คุณได้อยู่ในการสนทนาทางวิดีโอเป็นกลุ่มเรียบร้อยแล้ว";
"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_EXPLANATION" = "คุณสามารถทำการสนทนาทางวิดีโอเป็นกลุ่มได้ครั้งละหนึ่งกลุ่มเท่านั้น";

"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_MESSAGE" = "คุณถึงจำกัดสำหรับการโทรครั้งนี้แล้ว";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION_BETA" = "คุณถึงขีดจำกัดเวลา 4 ชั่วโมงสำหรับวิดีโอกลุ่มในการสนทนาครั้งนี้แล้ว";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION" = "คุณถึงขีดจำกัดเวลา 4 ชั่วโมงสำหรับวิดีโอกลุ่มในการสนทนาครั้งนี้แล้ว ตรวจสอบรายละเอียดได้ที่บัญชีผู้ใช้ของคุณ";

"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_MESSAGE" = "คุณถึงขีดจำกัดของวิดีโอกลุ่มของคุณสำหรับวันนี้แล้ว";
"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_EXPLANATION" = "การสนทนาทางวิดีโอเป็นกลุ่มถูกระงับไว้ชั่วคราว คุณได้ถึงขีดจำกัดการใช้งานของคุณสำหรับวันนี้แล้ว ตรวจสอบรายละเอียดได้ที่บัญชีผู้ใช้ของคุณ";

"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_MESSAGE" = "คุณถึงขีดจำกัดของวิดีโอกลุ่มของคุณสำหรับเดือนนี้แล้ว";
"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_EXPLANATION" = "การสนทนาทางวิดีโอเป็นกลุ่มถูกระงับไว้ชั่วคราว คุณได้ถึงขีดจำกัดการใช้งานของคุณสำหรับเดือนนี้แล้วตรวจสอบรายละเอียดได้ที่บัญชีผู้ใช้ของคุณ";

/*
"PV_RESULT_430_GRACE_TIME_EXPIRED_MESSAGE" = "RESULT_430_GRACE_TIME_EXPIRED";
*/

"PV_RESULT_500_GENERAL_SERVICE_ERROR_MESSAGE" = "วิดีโอกลุ่มไม่พร้อมใช้งานในขณะนี้";
"PV_RESULT_500_GENERAL_SERVICE_ERROR_EXPLANATION" = "เกิดข้อผิดพลาด โปรดลองอีกครั้งในภายหลัง";

/*
"PV_RESULT_503_SERVICE_TIMEOUT_MESSAGE" = "RESULT_503_SERVICE_TIMEOUT";
*/

"PremiumVideoErrorRecovery_GetPremium_BETA" = "รับวิดีโอกลุ่ม";
"PremiumVideoErrorRecovery_GetPremium" = "รับวิดีโอกลุ่ม";
"PremiumVideoErrorRecovery_UpgradePremium" = "อัพเกรด";

/* ===== SKAccessSessionFailureReasonErrorDomain Errors ===== */

"AccessSession::NO_BALANCE" = "คุณต้องมีเครดิต Skype เพื่อที่จะใช้ Skype WiFi";
"AccessSession::LOGIN_FAILURE" = "เราไม่รู้จักชื่อ Skype และรหัสผ่านของคุณ";
"AccessSession::WISPR_LOGIN_REJECTED" = "ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง";

"SKYPEACCESS_NO_ACCOUNT" = "โปรดลงชื่อเข้าใช้ด้วยบัญชีผู้ใช้ Skype ของคุณ";

"SKYPEACCESS_GENERIC_CONNECTION_ERROR" = "ไม่สามารถเชื่อมต่อได้ ตรวจสอบความแรงสัญญาณ WiFi หรือลองใช้จุดบริการ WiFi อื่น";
"SKYPEACCESS_GENERIC_FATAL_ERROR" = "จุดบริการนี้ไม่ตอบสนองอย่างถูกต้อง โปรดลองใช้จุดบริการอื่น";

"SKYPEACCESS_SESSION_EXTEND_ERROR" = "ไม่สามารถต่ออายุช่วงเวลาการใช้ได้ ลองทำการเชื่อมต่ออีกครั้ง";

"SKYPEACCESS_SESSION_LOSTWIFI_MESSAGE" = "เครือข่าย WiFi “%@” ไม่พร้อมใช้งานอีกต่อไป";
"SKYPEACCESS_SESSION_LOSTWIFI_EXPLANATION" = "เพื่อป้องกันการคิดค่าบริการเกินกว่าที่คาดไว้ ให้ยกเลิกการเชื่อมต่อทุกครั้งก่อนย้ายออกไปจากจุดบริการ WiFi หรือปิดอุปกรณ์ของคุณ";

"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_MESSAGE" = "โปรดเข้าร่วมเครือข่าย WiFi “%@” ใหม่";
"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_EXPLANATION" = "Skype WiFi จะพยายามหยุดการเชื่อมต่ออินเทอร์เน็ตของคุณ เพื่อป้องกันการคิดค่าบริการเกินกว่าที่คาดไว้ ให้ยกเลิกการเชื่อมต่อทุกครั้งก่อนย้ายออกไปจากจุดบริการ WiFi หรือปิดอุปกรณ์ของคุณ";

"SKYPEACCESS_SESSION_LOSTWIFI_AUTO_END_MESSAGE" = "ระบบได้หยุดการเชื่อมต่ออินเทอร์เน็ตของคุณ";

"ACCESS_PRICE_PER_MINUTE_FORMAT" = "%@ ต่อนาที";
"ACCESS_PRICE_PER_MINUTE_FREE" = "ฟรี";

/*
 * ===========
 * SkyLib localization (Skype Kit messages sent by SkyLib to other clients)
 * ===========
 */

/* Message sent in the P2P chat after it has been migrated to a server-based chat, and seen by legacy client users. */
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P" = "มีการอัพเดตกลุ่มนี้ให้มีประสิทธิภาพในการแชทที่ดียิ่งขึ้น \nเมื่อต้องการเข้าร่วมและไม่พลาดการแชท สามารถขอรับการดาวน์โหลดเวอร์ชันล่าสุดได้ \nไปที่ <a href=\"http://www.skype.com/updateme\">Skype.com/updateme</a>";
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P_DOGFOOD" = "มีการอัพเดตกลุ่มนี้ให้มีประสิทธิภาพในการแชทที่ดียิ่งขึ้น \nเมื่อต้องการเข้าร่วมและไม่พลาดการแชท สามารถขอรับการดาวน์โหลดเวอร์ชันล่าสุดได้ \nไปที่ https://microsoft.sharepoint.com/teams/DogfoodSkype/";

/* Message sent in the server-based chat as first message. Used to link the history of both conversations. The '%1' is replaced with the ID of the old chat. */
"LOCALIZED_UPGRADE_MESSAGE_IN_SERVER_BASED" = "คลิก <a href=\"skype:?chat&amp;id=%1\">ที่นี่</a> เพื่อดูประวัติก่อนหน้า";
